IF OBJECT_ID('dbo.Lesson', 'U') IS NOT NULL
BEGIN TRANSACTION
SET IDENTITY_INSERT [dbo].[Lesson] ON
MERGE [dbo].[Lesson] AS TARGET
    USING (VALUES
    ------------------------------------------Квітень
	(1, '2019-04-2 19:00', N'Малий зал', 1),--1
	(2, '2019-04-2 20:30', N'Малий зал', 2),--2
	(3, '2019-04-4 19:00', N'Малий зал', 1),--3
	(4, '2019-04-4 20:30', N'Малий зал', 2),--4
	(5, '2019-04-9 19:00', N'Малий зал', 1),--5
	(6, '2019-04-9 20:30', N'Малий зал', 2),--6
	(7, '2019-04-11 19:00', N'Малий зал', 1),--7
	(8, '2019-04-11 20:30', N'Малий зал', 2),--8
	(9, '2019-04-16 19:00', N'Малий зал', 1),--9
	(10, '2019-04-16 20:30', N'Малий зал', 2),--10
	(11, '2019-04-18 19:00', N'Малий зал', 1),--11
	(12, '2019-04-18 20:30', N'Малий зал', 2),--12
	(13, '2019-04-23 19:00', N'Малий зал', 1),--13
	(14, '2019-04-23 20:30', N'Малий зал', 2),--14
	(15, '2019-04-25 19:00', N'Малий зал', 1),--15
	(16, '2019-04-25 20:30', N'Малий зал', 2),--16
	(17, '2019-04-30 19:00', N'Малий зал', 1),--17
	(18, '2019-04-30 20:30', N'Малий зал', 2),--18
	------------------------------------------Травень
	(19, '2019-05-2 19:00', N'Малий зал', 1),--19
	(20, '2019-05-2 20:30', N'Малий зал', 2),--20
	(21, '2019-05-7 19:00', N'Малий зал', 1),--21
	(22, '2019-05-7 20:30', N'Малий зал', 2),--22
	(23, '2019-05-9 19:00', N'Малий зал', 1),--23
	(24, '2019-05-9 20:30', N'Малий зал', 2),--24
	(25, '2019-05-14 19:00', N'Малий зал', 1),--25
	(26, '2019-05-14 20:30', N'Малий зал', 2),--26
	(27, '2019-05-16 19:00', N'Малий зал', 1),--27
	(28, '2019-05-16 20:30', N'Малий зал', 2),--28
	(29, '2019-05-21 19:00', N'Малий зал', 1),--29
	(30, '2019-05-21 20:30', N'Малий зал', 2),--30
	(31, '2019-05-23 19:00', N'Малий зал', 1),--31
	(32, '2019-05-23 20:30', N'Малий зал', 2),--32
	(33, '2019-05-28 19:00', N'Малий зал', 1),--33
	(34, '2019-05-28 20:30', N'Малий зал', 2),--34
	(35, '2019-05-30 19:00', N'Малий зал', 1),--35
	(36, '2019-05-30 20:30', N'Малий зал', 2),--36
	------------------------------------------Червень
    (37, '2019-06-4 19:00', N'Малий зал', 1),--37
    (38, '2019-06-4 20:30', N'Малий зал', 2),--38
    (39, '2019-06-6 19:00', N'Малий зал', 1),--39
    (40, '2019-06-6 20:30', N'Малий зал', 2),--40
    (41, '2019-06-11 19:00', N'Малий зал', 1),--41
    (42, '2019-06-13 20:30', N'Малий зал', 2))--42
    AS SOURCE ([Id], [Date], [Room], [GroupId])
    ON TARGET.Id = SOURCE.Id
    WHEN NOT MATCHED BY TARGET THEN
        INSERT ([Id], [Date], [Room], [GroupId])
        VALUES ([Id], [Date], [Room], [GroupId]);
SET IDENTITY_INSERT [dbo].[Lesson] OFF
COMMIT;