IF OBJECT_ID('dbo.User', 'U') IS NOT NULL
BEGIN TRANSACTION
SET IDENTITY_INSERT [dbo].[User] ON
MERGE [dbo].[User] AS TARGET
    USING (VALUES
    --Admins and teachers
    (1, N'Оксана', N'Андрущенко', '+380104995985', 3 ),
    (2, N'Мар''ян', N'Пелюх', '+380994543613', 2 ),
    (3, N'Мар''яна', N'Луцишин', '+380816285545', 3 ),
    (4, N'Олександр', N'Січкар', '+380813655545', 2 ),
    (5, N'Роман', N'Пахолків', '+380760155782', 2 ),
    (6, N'Мар''яна', N'Штокало', '+380774155782', 2 ),
    (7, N'Ігор', N'Коваль', '+380837451111', 2 ),
    (8, N'Анна', N'Данчук', '+380792884834', 2 ),
    (9, N'Ольга', N'Коробчук', '+380792784834', 2 ),
    --Students
    (10, N'Каріна', N'Кравченко', '+380635595952', 3 ),
    (11, N'Юрій', N'Чабаренко', '+380730401631', 3 ),
    (12, N'Андрій', N'Панчишин', '+380730041631', 3 ),
    (13, N'Любов', N'Горбова', '+380671793382', 3 ),
    (14, N'Оксана', N'Котик', '+380979071237', 3 ),
    (15, N'Уляна', N'Коваль', '+380988737362', 3 ),
    (16, N'Дзвонемира', N'Довгалюк', '+380680356776', 3 ),
    (17, N'Артем', N'Монастирев', '+380934627446', 3 ),
    (18, N'Анна-Тереза', N'Бенко', '+380504627446', 3 ),
    (19, N'Оксана', N'Кость', '+380550933568', 3 ),
    (20, N'Володимир', N'Бережанський', '+380950427186', 3 ),
    (21, N'Юлія', N'Рубаха', '+380445930404', 3 ),
    (22, N'Діана', N'Срібна', '+380324972238', 3 ),
    (23, N'Юрій', N'Трофімов', '+380632167853', 3 ),
    (24, N'Олександр', N'Сущий', '+380679560426', 3 ),
    (25, N'Ірена', N'Одинець', '+380681005145', 3 ),
    (26, N'Івасик', N'Телесик', '+380964276559', 3 ),
    (27, N'Микита', N'Лис', '+380987666295', 3 ),
    (28, N'Котигорошко', N'Булавоносець', '+380975110480', 3 ),
    (29, N'Петрик', N'П''яточкін', '+380739110666', 3 ),
    (30, N'Капітошка', N'Малий', '+380559475073', 3 ),
    (31, N'Вовчик', N'Братик', '+380934946898', 3 ),
    (32, N'Кривенька', N'Качечка', '+380634019407', 3))
    AS SOURCE ([Id], [FirstName], [LastName], [PhoneNumber], [RoleId])
    ON TARGET.Id = SOURCE.Id
    WHEN NOT MATCHED BY TARGET THEN
        INSERT ([Id], [FirstName], [LastName], [PhoneNumber], [RoleId])
        VALUES ([Id], [FirstName], [LastName], [PhoneNumber], [RoleId]);
SET IDENTITY_INSERT [dbo].[User] OFF
COMMIT;